# [스터디] 파이썬 :: 3.2 자료구조
> 작성일: 2018.07.16 | 작성자: 유현지

자료형이란 프로그래밍을 할 때 쓰이는 숫자, 문자열 등 자료 형태로 사용하는 모든 것을 뜻한다. 프로그램의 기본이자 핵심 단위가 바로 자료형이다. 계산 프로그램을 만들려면 어떤 것을 계산할지부터 알아야 하고, 데이터베이스 프로그램을 만들려면 어떤 자료를 저장할지부터 알아야하는 것처럼 기본 중의 기본이라고 할 수 있다. 

### 목차
1. [리스트](#m1)
2. [튜플](#m2)
3. [딕셔너리](#m3)
4. [집합](#m4)
5. [참고자료](#m5)

---
<a id="m1"></a> 
## 1. 리스트

### 1) 리스트 형태

```python
>>> a = [ ]  # a = list()
>>> a = [1, 2, 3] 
>>> a = ['Life', 'is', 'good']
>>> a = [1, 2, ['Life', 'is', 'good']]  # 리스트 자체를 요소값으로 가질 수 있음.
```

### 2) 리스트의 인덱싱과 슬라이싱

- **인덱싱**
```python
>>> a = [1, 2, 3, ['a', 'b', 'c']]
>>> a[3]  # (=a[-1])
['a', 'b', 'c']
>>> a[3][0]
'a'
```

- **슬라이싱**
```python
>>> a = [1, 2, 3, ['a', 'b', 'c'], 4, 5]
>>> a[2:5]
[3, ['a', 'b', 'c'],4]
>>> a[3][:2]
['a', 'b']
```

### 3) 리스트 연산자

- '+' **리스트 더하기**  
- '*' **리스트 반복**

#### <연산시 주의할 점>
```python
>>> a = [1, 2, 3]
>>> a[2] + 'hi'
# TypeError 발생!!

>>> str(a[2]) + "hi"
'3hi'
```

### 4) 리스트 수정 및 삭제

- **수정**
```python
>>> a = [1, 2, 3]
>>> a[2] = 4
>>> a
[1, 2, 4]

# 연속된 값 수정
>>> a[1:2]
[2]
>>> a[1:2] = ['a', 'b']
>>> a
[1, 'a', 'b', 3]

# 요소 변경
>>> a[1] = ['a', 'b']
>>> a
[1, ['a', 'b'], 3]
```

- **삭제**
```python
# [] 이용한 요소 삭제
>>> a = [1, 'a', 'b', 3]
>>> a[1:3] = [ ]
>>> a
[1, 3]

# del() 함수 이용한 요소 삭제
>>> a = [1, 3]
>>> del a[0]
>>> a
[3]
```

### 5) 리스트 관련 함수

- **append()** : 리스트에 요소 추가
```python
>>> a = [1, 2]
>>> a.append([3, 4])
>>> a
[1, 2, [3, 4]]
```

- **index()** : 위치 반환
```python
>>> a = [1, 2, 3]
>>> a.index(2) 
1
```

- **insert() & remove()** : 요소 삽입, 제거
```python
>>> a = [2, 3, 4]
>>> a.insert(0, 1)  # 첫번째 요소(=a[0])에 '1' 삽입
>>> a
[1, 2, 3, 4]

>>> a = [1, 2, 3, 1, 2, 3]
>>> a. remove(3)  # 리스트에서 첫 번째로 나오는 '3' 제거
>>> a
[1, 2, 1, 2, 3]
```

- **pop()** : 리스트 요소 반환한 후, 그 요소 제거
```python
# 리스트 맨 마지막 요소 반환 후, 제거
>>> a = [1, 2, 3]
>>> a.pop()
3
>>> a
[1, 2]

# 리스트 x번째 요소 반환 후, 제거
>>> a = [1, 2, 3]
>>> a.pop(1)
2
>>> a
[1, 3]
```

- **extend()** : 리스트 확장 ( extend(x)에서 x에는 오직 리스트만 올 수 있음! )
```python
>>> a = [1, 2]
>>> a.extend([3, 4, 5])
>>> a
[1, 2, 3, 4, 5]
```

- **sort()** : 오름차순, 알파벳 순서로 정렬
- **reverse()** : 리스트 뒤집기
- **count()** : 요소 x의 개수

<a id="back1"></a>
> 리스트 요소 제거 방법 3가지 - [참고자료1](#ref1)  

<a id ="q1"></a>
#### ** Question01 - [정답보기](#sol1)
```
# 리스트 정렬
[1, 3, 5, 4, 2] 리스트를 [5, 4, 3, 2, 1]로 만들어보기.
```

<a id ="q2"></a>
#### ** Question02 - [정답보기](#sol2)
**더하기 연산자와 extend()를 이용한 요소값 추가의 결과는 같다.**  
**둘의 차이점은 무엇인가?**
```python
>>> a = [1, 2, 3]
>>> a = a + [4, 5]
>>> a
[1, 2, 3, 4, 5]

>>> a = [1, 2, 3]
>>> a.extend([4, 5])
>>> a
[1, 2, 3, 4, 5]
```

---
<a id="m2"></a> 
## 2. 튜플

### 1) 튜플의 특징 및 형태
- ##### 리스트는 [ ] 형태이고, 튜플은 ( ) 형태이다.
- ##### 리스트는 요소값의 생성, 삭제, 수정 가능하지만 튜플은 값을 바꿀 수 없다.
    > ###### 튜플의 요소값은 한 번 정해지면, 지우거나 변경할 수 없다!!!
```python
>>> t1 = ()
>>> t2 = (1,)  # 1개의 요소만을 가질 때, 반드시 콤마(,)를 붙여야 함.
>>> t3 = (1, 2, 3)
>>> t4 = 1, 2, 3  # 괄호() 생략 가능.
>>> t5 = 1,
>>> t6 = (1, 2, (3, 4, 5))  
```

### 2) 인덱싱과 슬라이싱
```python
>>> t1 = (1, 2, 'a', 'b')
>>> t1[1]
2
>>> t1[2:]
('a', 'b')
```

### 3) 더하기(+)와 곱하기(*)
```python
>>> t1 = (1,)
>>> t2 = (2, 3)
>>> t1 + t2
(1, 2, 3)
>>> t2 * 3
(2, 3, 2, 3, 2, 3)
```

<a id ="q3"></a>
#### ** Question03 - [정답보기](#sol3)
```
# 튜플 추가
(1, 2, 3)이라는 튜플에 4라는 값을 추가하여 (1, 2, 3, 4)로 만들어보자.
```


---
<a id="m3"></a> 
## 3. 딕셔너리

### 1) 딕셔너리의 개념 및 형태
- ##### 대응관계를 나타내는 자료형. 이를 연관배열(Associative array) 또는 해시(Hash)라고 함.
- ##### Key와 Value 한 쌍으로 갖는 자료형 (ex. {Key:Value}).
- ##### Key에는 변하지 않는 값을 사용하고, Value에는 변하는 값과 변하지않는 값 모두 사용가능.
```python
>>> dic = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
```
| Key    | Value      |
|--------|:----------:|
| name   | pey        |
| phone  | 0119993323 |
| birth  | 1118       |

### 2) 딕셔너리 추가 및 삭제
```python
>>> a = {1:'a'}
>>> a[2] = 'b'
>>> a
{1:'a', 2:'b'}
>>> a[3] = [3, 4]  # 리스트도 추가 가능.
>>> a
{1:'a', 2:'b', 3:[3, 4]} 

>>> del a[1]  # 지정한 Key와 그에 대응되는 Value값 함께 삭제.
>>> a
{2:'b', 3:[3, 4]}
```

### 3) 딕셔너리 생성시 주의사항
- ##### Key값은 중복으로 사용할 수 없다.
- ##### Key에는 리스트를 쓸 수 없다. 하지만, 튜플은 가능!!!
- ##### 리스트는 값이 변할 수 있고, 튜플은 값이 변하지 않기 때문.


### 4) 딕셔너리 관련 함수
- #### Key 리스트 만들기(keys)
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> a.keys()  # 딕셔너리 a의 key만 모아서 dict_keys 객체 리턴
dict_keys(['name', 'phone', 'birth'])
```

- #### Value 리스트 만들기(values)
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> a.values()
dict_values(['pey', '0119993323', '1118'])
```

- #### Key, Value 쌍(items)
    > ###### 튜플로 묶은 값을 dict_items 객체로 돌려줌.
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> a.items()
dict_items([('name', 'pey'), ('phone', '0119993323'), ('birth', '1118')])
```

- #### Key, Value 쌍 지우기(clear)
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> a.get('name')
'pey'
```

- #### Key로 Value 얻기(get)
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> a.clear()
>>> a
{}
```

- #### 해당 Key가 딕셔너리 안에 있는지 조사(in)
```python
>>> a = {'name':'pey', 'phone':'0119993323', 'birth':'1118'}
>>> 'name' in a
True
```


---
<a id="m4"></a> 
## 4. 집합

### 1) 집합 자료형의 형태 및 특징
```python
>>> s1 = set([1, 2, 3])
>>> s1
{1, 2, 3}
>>> s2 = set("Hello")
>>> s2
{'e', 'H', 'l', 'o'}
```
- ##### 중복 안됨.
- ##### 순서 없음.
    > ###### set 자료형은 순서가 없기 때문에 인덱싱으로 값을 얻을 수 없다. 만약, 인덱싱으로 접근하고자 하면, 리스트나 튜플로 변환 후 해야한다.
```python
>>> s1 = set([1, 2, 3])
>>> l1 = list(s1)
>>> l1[0]
1
>>> t1 = tuple(s1)
>>> t1[1]
2
```

### 2) 집합 자료형 활용
```python
>>> s1 = set([1, 2, 3, 4, 5, 6])
>>> s2 = set([4, 5, 6, 7, 8, 9])
```

- #### 교집합
```python
>>> s1 & s2
{4, 5, 6}
>>> s1.intersection(s2)  # =s2.intersection(s1)
{4, 5, 6}
```

- #### 합집합
```python
>>> s1 | s2
{1, 2, 3, 4, 5, 6, 7, 8, 9}  # set자료형은 중복 허용안됨.
>>> s1.union(s2)
{1, 2, 3, 4, 5, 6, 7, 8, 9}
```

- #### 차집합
```python
>>> s1 - s2
{1, 2, 3}
>>> s1.difference(s2)
{1, 2, 3}
```

### 3) 집합 자료형 관련 함수

- #### 값 1개 추가(add)
```python
>>> s1 = set([1, 2, 3])
>>> s1.add(4)
>>> s1
{1, 2, 3, 4}
```

- #### 값 여러개 추가(update)
```python
>>> s1 = set([1, 2, 3])
>>> s1.update([4, 5, 6])
>>> s1
{1, 2, 3, 4, 5, 6}
```

- #### 특정 값 제거(remove)
```python
>>> s1 = set([1, 2, 3])
>>> s1.remove(2)
>>> s1
{1, 3}
```


---
<a id="m5"></a> 
## 5. 참고자료

<a id="ref1"></a>
- ### 리스트 요소 제거 방법 정리

1. ##### remove 함수 이용
    ###### 요소값 삭제
```python
>>> a = [1, 2, 'a', 'b']
>>> a.remove('a')
>>> a
[1, 2, 'b']
```

2. ##### pop 함수 이용
    ###### 인덱스를 이용한 요소값 삭제
```python
>>> a = [1, 2, 'a', 'b']
>>> a.pop(1)
>>> a
[1, 'a', 'b']
```

3. ##### del 이용
    ###### 인덱스를 이용한 요소값 삭제
```python
>>> a = [1, 2, 'a', 'b']
>>> del a[2]
>>> a
[1, 2, 'b']
```
[돌아가기](#back1)

---
<a id="sol1"></a>
- **Answer01**  
[문제로 돌아가기](#q1)
```python
>>> a = [1, 3, 5, 4, 2]
>>> a.sort()  # [1, 2, 3, 4, 5] 
>>> a.reverse()
>>> a
[5, 4, 3, 2, 1]
```

<a id="sol2"></a>
- **Answer02**  
[문제로 돌아가기](#q2)
```python
# 더하기 연산자는 두 리스트가 더해진 새로운 리스트 생성.
>>> a = [1, 2, 3]
>>> id(a)
1752273359880
>>> a = a + [4, 5]
>>> id(a)
1752272207048

# extend 연산자는 같은 리스트 안에 요소값만 추가.
>>> a.extend([4, 5])
>>> id(a)
1752273359880
```

<a id="sol3"></a>
- **Answer03**  
[문제로 돌아가기](#q3)
```python
>>> a = (1, 2, 3)
>>> id(a)
1752273133432
>>> a = a + (4,)
>>> a
(1, 2, 3, 4)
>>> id(a)
1752273272488
# a의 고유 주소값이 변경됨.
# a 튜플의 값이 변경되는 것이 아니라 새로운 튜플이 생성되고, 그 값이 a 변수에 대입되는 것.
```
